src/mp_toir/InformationRegisters/ХранилищеПерсональныхНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ХранилищеПерсональныхНастроек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеНастройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/mp_toir/SettingsStorages/ХранилищеПерсональныхНастроек/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура СохранитьНастройку(Пользователь, ОбъектНастройки, ВидНастройки, Значение) Экспорт

	Набор = РегистрыСведений.ХранилищеПерсональныхНастроек.СоздатьНаборЗаписей();

	Набор.Отбор.Пользователь.Установить(Пользователь);
	Набор.Отбор.ОбъектНастройки.Установить(ОбъектНастройки);
	Набор.Отбор.ВидНастройки.Установить(ВидНастройки);
	Набор.Записать(Истина);
	
	НоваяСтрока = Набор.Добавить();
	НоваяСтрока.Пользователь  = Пользователь;
	НоваяСтрока.ОбъектНастройки   = ОбъектНастройки;
	НоваяСтрока.ВидНастройки  = ВидНастройки;
	НоваяСтрока.ЗначениеНастройки = Новый ХранилищеЗначения(Значение);

	Набор.Записать(Истина);

КонецПроцедуры

Функция ЗагрузитьНастройку(Пользователь, ОбъектНастройки, ВидНастройки, ЗначениеПоУмолчанию) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Настройки.ЗначениеНастройки КАК ЗначениеНастройки
	|ИЗ
	|	РегистрСведений.ХранилищеПерсональныхНастроек КАК Настройки
	|ГДЕ
	|	Настройки.Пользователь = &Пользователь
	|	И Настройки.ОбъектНастройки = &ОбъектНастройки
	|	И Настройки.ВидНастройки = &ВидНастройки";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ОбъектНастройки", ОбъектНастройки);
	Запрос.УстановитьПараметр("ВидНастройки", ВидНастройки);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Если Не ЗначениеЗаполнено(Выборка.ЗначениеНастройки) Тогда
			Возврат ЗначениеПоУмолчанию;
		КонецЕсли;

		Попытка
			Возврат Выборка.ЗначениеНастройки.Получить();
		Исключение
			Возврат ЗначениеПоУмолчанию;
		КонецПопытки;
	Иначе
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;

КонецФункции

Функция ЗагрузитьНастройки(Пользователь, ОбъектНастройки, НастройкиПоУмолчанию) Экспорт

	ВидыНастроек = Новый Массив;
	Для Каждого ТекНастройка Из НастройкиПоУмолчанию Цикл
		ВидыНастроек.Добавить(ТекНастройка.Ключ);
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Настройки.ВидНастройки КАК ВидНастройки,
	|	Настройки.ЗначениеНастройки КАК ЗначениеНастройки
	|ИЗ
	|	РегистрСведений.ХранилищеПерсональныхНастроек КАК Настройки
	|ГДЕ
	|	Настройки.Пользователь = &Пользователь
	|	И Настройки.ОбъектНастройки = &ОбъектНастройки
	|	И Настройки.ВидНастройки В(&ВидНастройки)";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ОбъектНастройки", ОбъектНастройки);
	Запрос.УстановитьПараметр("ВидНастройки", ВидыНастроек);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Попытка
			НастройкиПоУмолчанию[Выборка.ВидНастройки] = Выборка.ЗначениеНастройки.Получить();
		Исключение
			// При ошибке чтения оставляем значение по умолчанию
		КонецПопытки;
	КонецЦикла;

	Возврат НастройкиПоУмолчанию;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
